export const REGION_MAP: Record<string, string> = {
  'เชียงใหม่': 'ภาคเหนือ', 'เชียงราย': 'ภาคเหนือ', 'ลำปาง': 'ภาคเหนือ', 'ลำพูน': 'ภาคเหนือ',
  'แม่ฮ่องสอน': 'ภาคเหนือ', 'น่าน': 'ภาคเหนือ', 'พะเยา': 'ภาคเหนือ', 'แพร่': 'ภาคเหนือ', 'อุตรดิตถ์': 'ภาคเหนือ',
  'กรุงเทพมหานคร': 'ภาคกลาง', 'นนทบุรี': 'ภาคกลาง', 'ปทุมธานี': 'ภาคกลาง', 'สมุทรปราการ': 'ภาคกลาง',
  'สมุทรสาคร': 'ภาคกลาง', 'สมุทรสงคราม': 'ภาคกลาง', 'พระนครศรีอยุธยา': 'ภาคกลาง', 'อ่างทอง': 'ภาคกลาง',
  'ลพบุรี': 'ภาคกลาง', 'สิงห์บุรี': 'ภาคกลาง', 'ชัยนาท': 'ภาคกลาง', 'สระบุรี': 'ภาคกลาง', 'นครนายก': 'ภาคกลาง',
  'นครปฐม': 'ภาคกลาง', 'สุพรรณบุรี': 'ภาคกลาง',
  'นครราชสีมา': 'ภาคอีสาน', 'ขอนแก่น': 'ภาคอีสาน', 'อุบลราชธานี': 'ภาคอีสาน', 'อุดรธานี': 'ภาคอีสาน',
  'บุรีรัมย์': 'ภาคอีสาน', 'สุรินทร์': 'ภาคอีสาน', 'ศรีสะเกษ': 'ภาคอีสาน', 'ร้อยเอ็ด': 'ภาคอีสาน',
  'มหาสารคาม': 'ภาคอีสาน', 'ชัยภูมิ': 'ภาคอีสาน', 'สกลนคร': 'ภาคอีสาน', 'กาฬสินธุ์': 'ภาคอีสาน',
  'ยโสธร': 'ภาคอีสาน', 'นครพนม': 'ภาคอีสาน', 'มุกดาหาร': 'ภาคอีสาน', 'หนองบัวลำภู': 'ภาคอีสาน',
  'หนองคาย': 'ภาคอีสาน', 'อำนาจเจริญ': 'ภาคอีสาน', 'เลย': 'ภาคอีสาน', 'บึงกาฬ': 'ภาคอีสาน',
  'สงขลา': 'ภาคใต้', 'นครศรีธรรมราช': 'ภาคใต้', 'สุราษฎร์ธานี': 'ภาคใต้', 'ภูเก็ต': 'ภาคใต้',
  'กระบี่': 'ภาคใต้', 'พังงา': 'ภาคใต้', 'ตรัง': 'ภาคใต้', 'พัทลุง': 'ภาคใต้', 'ชุมพร': 'ภาคใต้',
  'ระนอง': 'ภาคใต้', 'สตูล': 'ภาคใต้', 'ปัตตานี': 'ภาคใต้', 'ยะลา': 'ภาคใต้', 'นราธิวาส': 'ภาคใต้',
  'ชลบุรี': 'ภาคตะวันออก', 'ระยอง': 'ภาคตะวันออก', 'จันทบุรี': 'ภาคตะวันออก', 'ตราด': 'ภาคตะวันออก',
  'ฉะเชิงเทรา': 'ภาคตะวันออก', 'ปราจีนบุรี': 'ภาคตะวันออก', 'สระแก้ว': 'ภาคตะวันออก',
  'กาญจนบุรี': 'ภาคตะวันตก', 'ราชบุรี': 'ภาคตะวันตก', 'เพชรบุรี': 'ภาคตะวันตก', 'ประจวบคีรีขันธ์': 'ภาคตะวันตก', 'ตาก': 'ภาคตะวันตก'
};
